artillery.yml
config:
  target: "http://54.67.70.247/"
  phases:
    - duration: 20
      arrivalRate: 100
  ws:
    rejectUnauthorized: false
  variables:
    listingIds:
      - "1"
      - "2"
      - "3"
      - "4"
      - "5"
      - "6"
      - "7"
      - "8"
      - "9"
      - "10"
      - "11"
      - "12"
      - "13"
      - "14"
      - "15"
      - "16"
      - "17"
      - "18"
      - "19"
      - "20"
scenarios:
  - flow:
      - get:
          url: "/api/rooms/{{ listingIds }}/reviews"